# Pandas - Renomeando Colunas e Índices de Dataframes

# Renomeando / mapeando rótulos 
O método rename() permite que você renomeie um eixo com base em algum mapeamento (um dicionário ou série) ou uma função arbitrária.

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('totaisregioes_arr.csv', sep=';',names =['REGIAO', 'CASOS','OBITOS'], index_col='REGIAO')
df.head()

                 CASOS  OBITOS
REGIAO
Centro-Oeste   4574674   67252
Nordeste       7571957  136957
Norte          2984041   52114
Sudeste       15594474  344537
Sul            8266663  113218

In [2]:
df['CASOS'].rename(str.upper).head()

REGIAO
CENTRO-OESTE     4574674
NORDESTE         7571957
NORTE            2984041
SUDESTE         15594474
SUL              8266663
Name: CASOS, dtype: int64

### Um dicionário ou série também pode ser usado
- Se o mapeamento não incluir um rótulo de coluna / índice, ele não será renomeado

In [3]:
df.rename(columns={'CASOS': 'Qtd.Casos', 'OBITOS': 'Qtd. Obitos'},
          index={'Centro-Oeste': 'CO', 'Nordeste': 'NE', 'Norte': 'N', 
                 'Sudeste': 'SE', 'Sul': 'S'})

        Qtd.Casos  Qtd. Obitos
REGIAO
CO        4574674        67252
NE        7571957       136957
N         2984041        52114
SE       15594474       344537
S         8266663       113218

In [4]:
df.rename({'CASOS': 'casos', 'OBITOS': 'obitos'}, axis='columns')

                 casos  obitos
REGIAO
Centro-Oeste   4574674   67252
Nordeste       7571957  136957
Norte          2984041   52114
Sudeste       15594474  344537
Sul            8266663  113218

In [5]:
df.rename({'Centro-Oeste': 'CO', 'Nordeste': 'NE', 'Norte': 'N', 
           'Sudeste': 'SE', 'Sul': 'S'}, axis='index')

           CASOS  OBITOS
REGIAO
CO       4574674   67252
NE       7571957  136957
N        2984041   52114
SE      15594474  344537
S        8266663  113218

In [6]:
df

                 CASOS  OBITOS
REGIAO
Centro-Oeste   4574674   67252
Nordeste       7571957  136957
Norte          2984041   52114
Sudeste       15594474  344537
Sul            8266663  113218

### Usando rename inplace

In [7]:
df.rename(columns={'CASOS': 'casos', 'OBITOS': 'obitos'},
      index={'Centro-Oeste': 'CO', 'Nordeste': 'NE', 'Norte': 'N', 'Sudeste': 'SE', 'Sul': 'S'},
         inplace=True)
df

           casos  obitos
REGIAO
CO       4574674   67252
NE       7571957  136957
N        2984041   52114
SE      15594474  344537
S        8266663  113218